[
  {
    "_id": "RS101",
    "name": "Rocket Propulsion",
    "number": "RS4550",
    "startDate": "2023-01-10",
    "endDate": "2023-05-15",
    "department": "D123",
    "credits": 4,
    "description": "This course provides an in-depth study of the fundamentals of rocket propulsion, covering topics such as propulsion theory, engine types, fuel chemistry, and the practical applications of rocket technology. Designed for students with a strong background in physics and engineering, the course includes both theoretical instruction and hands-on laboratory work",
    "pictureName": "RocketPropulsion.jpg"
  },
  {
    "_id": "RS102",
    "name": "Aerodynamics",
    "number": "RS4560",
    "startDate": "2023-01-10",
    "endDate": "2023-05-15",
    "department": "D123",
    "credits": 3,
    "description": "This course offers a comprehensive exploration of aerodynamics, focusing on the principles and applications of airflow and its effects on flying objects. Topics include fluid dynamics, airfoil design, lift and drag forces, and the aerodynamic considerations in aircraft design. The course blends theoretical learning with practical applications, suitable for students pursuing a career in aeronautics or astronautics engineering.",
    "pictureName": "Aerodynamics.jpg"
  },
  {
    "_id": "RS103",
    "name": "Spacecraft Design",
    "number": "RS4570",
    "startDate": "2023-01-10",
    "endDate": "2023-05-15",
    "department": "D123",
    "credits": 4,
    "description": "This course delves into the principles and practices of spacecraft design, offering students a detailed understanding of the engineering and technology behind spacecraft systems. Key topics include spacecraft structure, propulsion, power systems, thermal control, and payload integration. Emphasizing both theoretical concepts and practical skills, the course prepares students for careers in the space industry, with a focus on innovative design and problem-solving in the context of current and future space missions",
    "pictureName": "SpacecraftDesign.jpg"
  },
  {
    "_id": "RS104",
    "name": "Organic Chemistry",
    "number": "CH1230",
    "startDate": "2023-01-10",
    "endDate": "2023-05-15",
    "department": "D134",
    "credits": 3,
    "description": "Organic Chemistry is an in-depth course that explores the structure, properties, composition, and reactions of organic compounds and materials. The course covers various topics including hydrocarbons, functional groups, stereochemistry, and organic synthesis techniques. Students will learn about the mechanisms of organic reactions, spectroscopic methods for structure determination, and the role of organic chemistry in biological systems. Emphasis is placed on problem-solving and laboratory skills, preparing students for advanced studies in chemistry, medicine, and related fields.",
    "pictureName": "OrganicChemistry.jpg"
  },
  {
    "_id": "RS105",
    "name": "Inorganic Chemistry",
    "number": "CH1240",
    "startDate": "2023-01-10",
    "endDate": "2023-05-15",
    "department": "D134",
    "credits": 3,
    "description": "Inorganic Chemistry focuses on the properties, structures, and behaviors of inorganic and organometallic compounds. This course covers a range of topics including coordination chemistry, metal complexes, bonding theories, symmetry, and crystal field theory. Students will also explore the role of inorganic chemistry in real-world applications such as catalysis, materials science, and bioinorganic processes. Laboratory work emphasizes synthesis and analysis of inorganic compounds, fostering a deeper understanding of theoretical concepts.",
    "pictureName": "InorganicChemistry.jpg"
  },
  {
    "_id": "RS106",
    "name": "Physical Chemistry",
    "number": "CH1250",
    "startDate": "2023-01-10",
    "endDate": "2023-05-15",
    "department": "D134",
    "credits": 3,
    "description": "Physical Chemistry merges the principles of physics and chemistry to understand the physical properties of molecules, the forces that act upon them, and the chemical reactions they undergo. Key topics include thermodynamics, kinetics, quantum mechanics, and spectroscopy. The course provides a comprehensive understanding of molecular behavior, reaction dynamics, and the application of mathematical methods in solving chemical problems. Labs focus on experimental techniques and data analysis, equipping students with skills necessary for research and advanced study in chemistry and related fields.",
    "pictureName": "PhysicalChemistry.jpg"
  },
  {
    "_id": "RS107",
    "name": "Ancient Languages and Scripts of Middle-earth",
    "number": "ME101",
    "startDate": "2023-01-10",
    "endDate": "2023-05-15",
    "department": "Languages",
    "credits": 3,
    "description": "This course offers an exploration of the ancient languages and scripts found throughout Middle-earth, including Elvish (Sindarin and Quenya), Dwarvish (Khuzdul), and the Black Speech of Mordor. Students will learn the historical and cultural contexts of these languages, their linguistic structures, and their usage in various inscriptions and texts. Emphasis is on understanding the philological aspects and the role of language in shaping Middle-earth's history and lore.",
    "author": "654f9ec2ea7ead465908d1e3",
    "pictureName": "AncientLanguagesandScriptsofMiddle-earth.jpg"
  },
  {
    "_id": "RS108",
    "name": "History and Practice of Middle-earth Magic",
    "number": "ME103",
    "startDate": "2023-01-10",
    "endDate": "2023-05-15",
    "department": "Mystical Studies",
    "credits": 4,
    "description": "This course delves into the mystical and magical aspects of Middle-earth, examining the sources, practitioners, and manifestations of magic. Covering a range of magical beings, including Wizards, Elves, and Ents, as well as artifacts like the Rings of Power and Palantíri, students will learn about the philosophical and ethical dimensions of magic use. The course combines theoretical study with practical insights, offering a unique perspective on the magical forces that shape the events and destinies in the world of Middle-earth.",
    "author": "654f9ec2ea7ead465908d1e3",
    "pictureName": "HistoryandPracticeofMiddle-earthMagic.jpg"
  }
]